<!-- dflook/terraform-github-actions {"workspace":"staging","backend_type":"s3","label":"staging","backend":"320a88b8836cb04527386e6e3d38647582fe7ff92ecae877d0eeaa4264f4311d","plan_job_ref":"Job plan #2 at https://github.com/GSA/usnotify-ssb/actions/runs/4078261044","plan_hash":"e72dfc27bd5d63b2415ee2e933701f34ff85d9b7c8a2941bae95fe0e4d8b0508","plan_text_format":"text","version":"1.31.1"} -->
Terraform plan for __staging__
<details>
<summary>Plan: 19 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_user_policy_attachment.smtp_broker_policies["AWSCertificateManagerFullAccess"] will be created
  + resource "aws_iam_user_policy_attachment" "smtp_broker_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSCertificateManagerFullAccess"
      + user       = "ssb-smtp-broker"
    }

  # aws_iam_user_policy_attachment.smtp_broker_policies["AmazonRoute53FullAccess"] will be created
  + resource "aws_iam_user_policy_attachment" "smtp_broker_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonRoute53FullAccess"
      + user       = "ssb-smtp-broker"
    }

  # aws_iam_user_policy_attachment.smtp_broker_policies["smtp_broker"] will be created
  + resource "aws_iam_user_policy_attachment" "smtp_broker_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "ssb-smtp-broker"
    }

  # aws_kms_alias.zone[0] will be created
  + resource "aws_kms_alias" "zone" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/DNSSEC-notify-staging"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.zone[0] will be created
  + resource "aws_kms_key" "zone" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "*************"
      + deletion_window_in_days            = 7
      + description                        = (known after apply)
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "SIGN_VERIFY"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "kms:DescribeKey",
                          + "kms:GetPublicKey",
                          + "kms:Sign",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dnssec-route53.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow Route 53 DNSSEC Service"
                    },
                  + {
                      + Action    = "kms:CreateGrant"
                      + Condition = {
                          + Bool = {
                              + "kms:GrantIsForAWSResource" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dnssec-route53.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow Route 53 DNSSEC Service to CreateGrant"
                    },
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "IAM User Permissions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags_all                           = (known after apply)
    }

  # aws_route53_hosted_zone_dnssec.zone[0] will be created
  + resource "aws_route53_hosted_zone_dnssec" "zone" {
      + hosted_zone_id = (known after apply)
      + id             = (known after apply)
      + signing_status = "SIGNING"
    }

  # aws_route53_key_signing_key.zone[0] will be created
  + resource "aws_route53_key_signing_key" "zone" {
      + digest_algorithm_mnemonic  = (known after apply)
      + digest_algorithm_type      = (known after apply)
      + digest_value               = (known after apply)
      + dnskey_record              = (known after apply)
      + ds_record                  = (known after apply)
      + flag                       = (known after apply)
      + hosted_zone_id             = (known after apply)
      + id                         = (known after apply)
      + key_management_service_arn = (known after apply)
      + key_tag                    = (known after apply)
      + name                       = "notify-staging.rcahearn.net"
      + public_key                 = (known after apply)
      + signing_algorithm_mnemonic = (known after apply)
      + signing_algorithm_type     = (known after apply)
      + status                     = "ACTIVE"
    }

  # aws_route53_zone.zone[0] will be created
  + resource "aws_route53_zone" "zone" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "notify-staging.rcahearn.net"
      + name_servers  = (known after apply)
      + tags_all      = (known after apply)
      + zone_id       = (known after apply)
    }

  # module.broker_smtp.cloudfoundry_app.ssb will be created
  + resource "cloudfoundry_app" "ssb" {
      + buildpack                  = "binary_buildpack"
      + command                    = "source .profile && ./cloud-service-broker serve"
      + disk_quota                 = 2048
      + enable_ssh                 = true
      + environment                = (sensitive value)
      + health_check_http_endpoint = (known after apply)
      + health_check_timeout       = (known after apply)
      + health_check_type          = "port"
      + id                         = (known after apply)
      + id_bg                      = (known after apply)
      + instances                  = 1
      + memory                     = 256
      + name                       = "ssb-smtp"
      + path                       = "./app-ssb-smtp.zip"
      + ports                      = (known after apply)
      + source_code_hash           = "aJd/AbBGYTlIZOOZwPEATyFY6ra7e447sZTd5XhOOTg="
      + space                      = "d835086a-1ce4-4b9e-bb0f-6b01a560b24a"
      + stack                      = (known after apply)
      + stopped                    = false
      + strategy                   = "blue-green"
      + timeout                    = 60

      + routes {
          + port  = (known after apply)
          + route = (known after apply)
        }

      + service_binding {
          + service_instance = (known after apply)
        }
    }

  # module.broker_smtp.cloudfoundry_route.ssb_uri will be created
  + resource "cloudfoundry_route" "ssb_uri" {
      + domain   = "50ba3f69-cd54-4963-9172-14f3334b479e"
      + endpoint = (known after apply)
      + hostname = "ssb-smtp-gsa-tts-benefits-studio-prototyping-notify-management-staging"
      + id       = (known after apply)
      + port     = (known after apply)
      + space    = "d835086a-1ce4-4b9e-bb0f-6b01a560b24a"
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-management-staging"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = false
      + id                               = (known after apply)
      + name                             = "ssb-smtp-gsa-tts-benefits-studio-prototyping-notify-management-staging"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "d835086a-1ce4-4b9e-bb0f-6b01a560b24a"
      + url                              = (known after apply)
      + username                         = (known after apply)
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-sandbox"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = false
      + id                               = (known after apply)
      + name                             = "ssb-smtp-gsa-tts-benefits-studio-prototyping-notify-sandbox"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "420bb231-f99f-4dea-8cda-d342981d2718"
      + url                              = (known after apply)
      + username                         = (known after apply)
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-staging"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = false
      + id                               = (known after apply)
      + name                             = "ssb-smtp-gsa-tts-benefits-studio-prototyping-notify-staging"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "9745decb-4988-4bab-88a4-e3f07b36241c"
      + url                              = (known after apply)
      + username                         = (known after apply)
    }

  # module.broker_smtp.cloudfoundry_service_instance.db will be created
  + resource "cloudfoundry_service_instance" "db" {
      + id                             = (known after apply)
      + name                           = "ssb-smtp-db"
      + recursive_delete               = false
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "4b9e5bb1-d0d3-4c24-8542-e377cbb85aed"
      + space                          = "d835086a-1ce4-4b9e-bb0f-6b01a560b24a"
      + tags                           = [
          + "mysql",
        ]

      + timeouts {
          + create = "30m"
          + delete = "30m"
          + update = "30m"
        }
    }

  # module.broker_smtp.random_password.client_password will be created
  + resource "random_password" "client_password" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.broker_smtp.random_uuid.client_username will be created
  + resource "random_uuid" "client_username" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.smtp_broker_policy.aws_iam_policy.policy will be created
  + resource "aws_iam_policy" "policy" {
      + arn         = (known after apply)
      + description = "SMTP broker policy (covers SES, IAM, and supplementary Route53)"
      + id          = (known after apply)
      + name        = "smtp_broker"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ses:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "iam:CreateUser",
                          + "iam:DeleteUser",
                          + "iam:GetUser",
                          + "iam:CreateAccessKey",
                          + "iam:DeleteAccessKey",
                          + "iam:GetUserPolicy",
                          + "iam:PutUserPolicy",
                          + "iam:DeleteUserPolicy",
                          + "iam:CreatePolicy",
                          + "iam:DeletePolicy",
                          + "iam:GetPolicy",
                          + "iam:AttachUserPolicy",
                          + "iam:DetachUserPolicy",
                          + "iam:List*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "route53:ListHostedZones",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "sns:CreateTopic",
                          + "sns:DeleteTopic",
                          + "sns:SetTopicAttributes",
                          + "sns:GetTopicAttributes",
                          + "sns:ListTagsForResource",
                          + "sns:Subscribe",
                          + "sns:Unsubscribe",
                          + "sns:GetSubscriptionAttributes",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.ssb-smtp-broker-user.aws_iam_access_key.this_no_pgp[0] will be created
  + resource "aws_iam_access_key" "this_no_pgp" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "ssb-smtp-broker"
    }

  # module.ssb-smtp-broker-user.aws_iam_user.this[0] will be created
  + resource "aws_iam_user" "this" {
      + arn           = (known after apply)
      + force_destroy = true
      + id            = (known after apply)
      + name          = "ssb-smtp-broker"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

Plan: 19 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + client_spaces = [
      + "gsa-tts-benefits-studio-prototyping/notify-management-staging",
      + "gsa-tts-benefits-studio-prototyping/notify-sandbox",
      + "gsa-tts-benefits-studio-prototyping/notify-staging",
    ]
  + ds_record     = [
      + "DS",
      + "notify-staging.rcahearn.net",
      + (known after apply),
    ]
  + instructions  = "Create NS and DS records in the .rcahearn.net zone with the values indicated."
  + ns_record     = [
      + "NS",
      + "notify-staging.rcahearn.net",
      + (known after apply),
    ]
```
</details>

:x: Error applying plan in [apply #1](https://github.com/GSA/usnotify-ssb/actions/runs/4078399505)